<template>
  <div class="container">
    <UserInfo :user="user" />

    <SendFeedback />
  </div>
</template>

<script setup lang="ts">
import type { IUser } from "@/entities/User/model";
import { BASE_URL } from "@/shared/config";
import { UserInfo } from "@/widgets/User/UserInfo";
import SendFeedback from "@/features/Feedback/send-feedback/ui/SendFeedback.vue";

const user = {
  username: "Танделова Алина Людвиговна",
  avatar: `${BASE_URL}/image/photo.jpg`,
  aptitudes: [
    {
      id: 1,
      image: `${BASE_URL}/image/education.svg`,
      title: "Образование",
      positions: [
        {
          id: 1,
          text: "Российский университет дружбы народов им Патриса Лумумбы (РУДН)",
        },
        {
          id: 2,
          text: "Северо-Осетинская государственная академия (СОГМА)",
        },
      ],
    },
    {
      id: 2,
      image: `${BASE_URL}/image/diplom.svg`,
      title: "Дипломы",
      positions: [
        {
          id: 3,
          text: "Международный институт интегральной превентивной и антивозрастной медицины Preventage",
        },
      ],
    },
    {
      id: 3,
      image: `${BASE_URL}/image/example.svg`,
      title: "Опыт",
      positions: [
        {
          id: 5,
          text: "Медицинский центр «NEO»",
        },
        {
          id: 6,
          text: "ГКБ им. В. В. Виноградова ",
        },
        {
          id: 7,
          text: "ФБУ Центральная клиническая больница гражданской авиации",
        },
        {
          id: 8,
          text: "В данный момент консультирую на протяжени 3 лет в рамках частной практики",
        },
      ],
    },
  ],
  problems: [
    {
      id: 1,
      text: "Эндокринологические заболевания",
      description:
        "Заболевания щитовидной железы: гипотиреоз, тиреотоксикоз, хронический аутоиммунный тиреоидит, узловой зоб, диагностика и послеоперационное лечение рака щитовидной железы.\n" +
        "\n" +
        "Нарушение углеводного обмена: сахарного диабета, предиабета – нарушенной гликемии натощак, нарушенной толерантности к глюкозе.\n" +
        "\n" +
        "Артериальная гипертензия эндокринного генеза: вследствие гиперкортицизма, первичного гиперальдостеронизма, феохромоцитомы или вненадпочечниковой параганглиомы.\n" +
        "\n" +
        "Нейроэндокринные заболевания: болезнь Иценко-Кушинга, акромегалия, гиперпролактинемия и др. объемные образования гипоталамо-гипофизарной области.\n" +
        "\n" +
        "Заболевания надпочечников: хроническая надпочечниковая недостаточность, объемные образования надпочечников (гормонально-активные и гормонально-неактивные.\n" +
        "\n" +
        "Эндокринная патология во время беременности: в том числе заболеваний щитовидной железы, гестационного сахарного диабета, а также сахарного диабета, существующего до беременности.\n" +
        "\n" +
        "Патология фосфорно-кальциевого обмена: гиперпаратиреоз, гипопаратиреоз, остеопороз.",
    },
    {
      id: 2,
      text: "Оздоровление",
      description:
        "Нутрициологическая коррекция хронических заболеваний, подберу индивидуальный план питания, дам поддержку и мотивацию.",
    },
    {
      id: 3,
      text: "Подготовка семейных пар к беременности и восстановление после родов",
      description:
        "Улучшение репродуктивного здоровья протекания здоровой беременности, метаболического программирования здоровья будущего ребенка.",
    },
    {
      id: 4,
      text: "Восстановление правильной работы желудочно-кишечного тракта и нормализация его микробиотического мира",
      description:
        "Газы, боли, неусвоение пищи, нарушение оттока желчи, гастрит, проблемы с кислотностью желудка, запоры, диарея, бактериальная инфекция, кандидоз.",
    },
    {
      id: 5,
      text: "Проблемы с весом: его избыток или недостаток",
      description:
        "Составление индивидуального рациона питания, восстановление пищеварения, устранение нарушения обмена веществ, восполнение дефицитов макронутриентов(белки/жиры/углеводы) и микронутриентов (витамины и минералы).",
    },
    {
      id: 6,
      text: "Синдром хронической усталости",
      description:
        "Потеря энергии, дневная сонливость, проблемы со сном, бессоница.",
    },
    {
      id: 7,
      text: "Постковидный синдром",
      description:
        "Астенический синдром, общая слабость, общее недомогание, сонливость, ухудшение работоспособности, головокружение, головные боли, cнижение аппетита, трудности с концентрацией, замедление скорости реакции, а также мышления, восстановление обоняния, восстановление волос, кожи, ногтей.",
    },
  ],
  services: [
    {
      id: 1,
      text: "Первичная консультация",
      description:
        "Выявление основной причины беспокойства. Получение рекомендаций по более глубокому исследованию и работе с проблемой",
      price: 5000,
    },
    {
      id: 2,
      text: "Повторная консультация",
      description:
        "Корректируем первоначальную стратегию, смотрим динамику по анализам. Если вопрос практически полностью проработан, даю рекомендации на долгосрочную перспективу.",
      price: 4000,
    },
    {
      id: 3,
      text: 'Программа "Оздоровление" с сопровождением',
      description:
        "Перед консультацией высылаю Вам персонализированную анкету, дневник по питанию и необходимый список анализов и обследований.\n" +
        "Консультация проходит по аудио или видео связи.\n" +
        "Интерпретация лабораторных анализов и исследований.\n" +
        "План действий для изменения текущего состояния.\n" +
        "Персональные рекомендации по питанию и образу жизни.\n" +
        "Письменный отчёт с рекомендациями и разъяснениями. \n" +
        "Сопровождение Вас в течении месяца после получения рекомендаций.",
      price: 15000,
    },
  ],
} as IUser;
</script>

<style lang="scss" scoped>
.container {
  padding-top: 0;
}
</style>
